cases/openfoam.org/meshingAHelix/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
	
    inlet	
    {
		type			zeroGradient;
    }
    
    atmosphere	
    {
        type            totalPressure;
        p0              $internalField;
        rho             rho;
        U               U;
        psi             none;
        phi             phi;
        gamma           1;
        value           $internalField;
    }
    
    wall
    {
		 type            zeroGradient;
    } 
}

// ************************************************************************* //
