cases/openfoam.org/meshingAHelix/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 24;

boundaryField
{
   
    inlet	
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;     								  // % turbulent intensity
        value           $internalField;
    }
    
    atmosphere	
    {
        type            zeroGradient;
    }
    
    wall 
    {
        type            compressible::kqRWallFunction;
        value           $internalField;
    } 
}


// ************************************************************************* //
